<script>

  $:list = [
    { id: '001', title: 'Айвазовский' },
    { id: '002', title: 'Ян Вермеер' },
    { id: '003', title: 'М. Врубель' },
    { id: '004', title: 'Винсент Ван Гог' },
    { id: '005', title: 'Пабло Пикассо' },
    { id: '001', title: 'Айвазовский' },
    { id: '002', title: 'Ян Вермеер' },
    { id: '003', title: 'М. Врубель' },
    { id: '004', title: 'Винсент Ван Гог' },
    { id: '005', title: 'Пабло Пикассо' },
    { id: '001', title: 'Айвазовский' },
    { id: '002', title: 'Ян Вермеер' },
    { id: '003', title: 'М. Врубель' },
    { id: '004', title: 'Винсент Ван Гог' },
    { id: '005', title: 'Пабло Пикассо' },
    { id: '001', title: 'Айвазовский' },
    { id: '002', title: 'Ян Вермеер' },
    { id: '003', title: 'М. Врубель' },
    { id: '004', title: 'Винсент Ван Гог' },
    { id: '005', title: 'Пабло Пикассо' },
    { id: '001', title: 'Айвазовский' },
    { id: '002', title: 'Ян Вермеер' },
    { id: '003', title: 'М. Врубель' },
    { id: '004', title: 'Винсент Ван Гог' },
    { id: '005', title: 'Пабло Пикассо' },
    { id: '001', title: 'Айвазовский' },
    { id: '002', title: 'Ян Вермеер' },
    { id: '003', title: 'М. Врубель' },
    { id: '004', title: 'Винсент Ван Гог' },
    { id: '005', title: 'Пабло Пикассо' },
    { id: '001', title: 'Айвазовский' },
    { id: '002', title: 'Ян Вермеер' },
    { id: '003', title: 'М. Врубель' },
    { id: '004', title: 'Винсент Ван Гог' },
    { id: '005', title: 'Пабло Пикассо' },
    { id: '001', title: 'Айвазовский' },
    { id: '002', title: 'Ян Вермеер' },
    { id: '003', title: 'М. Врубель' },
    { id: '004', title: 'Винсент Ван Гог' },
    { id: '005', title: 'Пабло Пикассо' },
    { id: '001', title: 'Айвазовский' },
    { id: '002', title: 'Ян Вермеер' },
    { id: '003', title: 'М. Врубель' },
    { id: '004', title: 'Винсент Ван Гог' },
    { id: '005', title: 'Пабло Пикассо' },
    { id: '001', title: 'Айвазовский' },
    { id: '002', title: 'Ян Вермеер' },
    { id: '003', title: 'М. Врубель' },
    { id: '004', title: 'Винсент Ван Гог' },
    { id: '005', title: 'Пабло Пикассо' },
    
  ]

  function handler (obj){

    alert(obj.title)
  }
</script>

<div class="wrapper">
  <h3>Список выставок</h3>

  <ul>
    {#each list as obj}
      <li on:mousedown={()=>{handler(obj)}}>{obj.id} - {obj.title}</li>
    {/each}
  </ul>  
</div>

<style scoped>

.wrapper{
  background-color: #334;

  height: 100%;
  padding: 10px;
  padding-right: 20px;
}

ul{
  height: 90%;

}
</style>