<script>

  $:list = [
    { id: '001', title: 'Галерея, нижний этаж' },
    { id: '002', title: 'Галерея, первый этаж' },
    { id: '003', title: 'Галерея, второй этаж' },
    { id: '004', title: 'Галерея, третий этаж' },
    { id: '005', title: 'Галерея, Верхний этаж' },
    { id: '001', title: 'Галерея, нижний этаж' },
    { id: '002', title: 'Галерея, первый этаж' },
    { id: '003', title: 'Галерея, второй этаж' },
    { id: '004', title: 'Галерея, третий этаж' },
    { id: '005', title: 'Галерея, Верхний этаж' },
    { id: '001', title: 'Галерея, нижний этаж' },
    { id: '002', title: 'Галерея, первый этаж' },
    { id: '003', title: 'Галерея, второй этаж' },
    { id: '004', title: 'Галерея, третий этаж' },
    { id: '005', title: 'Галерея, Верхний этаж' },
    { id: '001', title: 'Галерея, нижний этаж' },
    { id: '002', title: 'Галерея, первый этаж' },
    { id: '003', title: 'Галерея, второй этаж' },
    { id: '004', title: 'Галерея, третий этаж' },
    { id: '005', title: 'Галерея, Верхний этаж' },
    { id: '001', title: 'Галерея, нижний этаж' },
    { id: '002', title: 'Галерея, первый этаж' },
    { id: '003', title: 'Галерея, второй этаж' },
    { id: '004', title: 'Галерея, третий этаж' },
    { id: '005', title: 'Галерея, Верхний этаж' },
    { id: '001', title: 'Галерея, нижний этаж' },
    { id: '002', title: 'Галерея, первый этаж' },
    { id: '003', title: 'Галерея, второй этаж' },
    { id: '004', title: 'Галерея, третий этаж' },
    { id: '005', title: 'Галерея, Верхний этаж' },
    { id: '001', title: 'Галерея, нижний этаж' },
    { id: '002', title: 'Галерея, первый этаж' },
    { id: '003', title: 'Галерея, второй этаж' },
    { id: '004', title: 'Галерея, третий этаж' },
    { id: '005', title: 'Галерея, Верхний этаж' },
    { id: '001', title: 'Галерея, нижний этаж' },
    { id: '002', title: 'Галерея, первый этаж' },
    { id: '003', title: 'Галерея, второй этаж' },
    { id: '004', title: 'Галерея, третий этаж' },
    { id: '005', title: 'Галерея, Верхний этаж' },
  ]

  function handler (obj){

    alert(obj.title)
  }
</script>

<div class="component">

  <h3>Список залов</h3>

  <ul>
    {#each list as obj}
      <li on:mousedown={()=>{handler(obj)}}>{obj.id} - {obj.title}</li>
    {/each}
  </ul>  
</div>

<style scoped>


</style>